<details ><summary>Digger run report at 2025-11-08 14:59:42 (UTC)</summary>
        <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "157515875446.my-app-dev-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Application" = "MyApp"
          + "Backup"      = "Daily"
          + "Compliance"  = "Standard"
          + "CostCenter"  = "Development"
          + "CreatedBy"   = "Terraform"
          + "DataClass"   = "Internal"
          + "Environment" = "dev"
          + "Monitoring"  = "Enabled"
          + "Owner"       = "hello@bohobot.com"
          + "Purpose"     = "Testing"
          + "Team"        = "Engineering"
          + "Version"     = "1.0"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_object.main will be created
  + resource "aws_s3_object" "main" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = jsonencode(
            {
              + app_name = "sample-app2"
              + debug    = true
              + env      = "dev"
              + version  = "1.2.3"
            }
        )
      + content_type           = "application/json"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "config/sample-app.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Application" = "MyApp"
          + "Environment" = "dev"
          + "Owner"       = "Engineering"
          + "Type"        = "Config"
          + "Version"     = "1.0"
        }
      + version_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```
</details>

<details ><summary>Terraform plan validation check (live_dev-account_us-east-1_s3-bucket-tag)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |       RESOURCE       |
|--------|----------------------|
| add    | `aws_s3_bucket.main` |
|        | `aws_s3_object.main` |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p live_dev-account_us-east-1_s3-bucket-tag
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>